home/config/emacs/config.org
** Todo

#+begin_src emacs-lisp :tangle yes
;; TODO states
(setq org-todo-keywords
      '((sequence "TODO(t)" "PLANNING(p)" "IN-PROGRESS(i@/!)" "VERIFYING(v!)" "BLOCKED(b@)"  "|" "DONE(d!)" "OBE(o@!)" "WONT-DO(w@/!)" )
        ))
;; TODO colors
(setq org-todo-keyword-faces
      '(
        ("TODO" . (:foreground "GoldenRod" :weight bold))
        ("PLANNING" . (:foreground "DeepPink" :weight bold))
        ("IN-PROGRESS" . (:foreground "Cyan" :weight bold))
        ("VERIFYING" . (:foreground "DarkOrange" :weight bold))
        ("BLOCKED" . (:foreground "Red" :weight bold))
        ("DONE" . (:foreground "LimeGreen" :weight bold))
        ("OBE" . (:foreground "LimeGreen" :weight bold))
        ("WONT-DO" . (:foreground "LimeGreen" :weight bold))
        ))
#+end_src

** Addons
**** Bullets

#+begin_src emacs-lisp
  (use-package org-bullets
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
#+end_src

**** Roam

note-taking and linking system

#+begin_src emacs-lisp :tangle no
  (use-package org-roam
    :after org
    :init
    (setq org-raom-v2-ack t)
    :custom
    (org-roam-directory "~/Notes")
    (org-roam-completion-everywhere t)
    :bind (("C-c n f" . org-roam-node-find)
	   ("C-c n l" . org-roam-buffer-toggle)
	   ("C-c n i" . org-roam-node-insert)
	   :map org-mode-map
	   ("C-M-i"   . completion-at-point))
    :config
    (org-roam-setup))
#+end_src

**** Write room

Creates a distraction-free writing environment by centering the buffer and dimming the text outside a narrow margin.

#+begin_src emacs-lisp
(use-package writeroom-mode
  :config
  (setq writeroom-width 120))

(my-leader-def
  "w" '(writeroom-mode :wk "Write room"))
#+end_src

**** Olivetti

Creates a visually comfortable writing environment by setting margins and narrowing the text column.

#+begin_src emacs-lisp
(use-package olivetti
  :config
  (setq olivetti-body-width 120)
  :hook (org-mode . olivetti-mode))
#+end_src

* Programming
** General setup
*** LSP
LSP-mode provides an IDE-like experience for Emacs - real-time diagnostics, code actions, intelligent autocompletion, etc.

References:
- [[https://emacs-lsp.github.io/lsp-mode/][lsp-mode homepage]]

**** Setup
#+begin_src emacs-lisp
  (use-package lsp-mode
    :commands (lsp .lsp-deferred)
    :hook
    (lsp-mode . lsp-enable-which-key-integration)
    (web-mode . lsp)
    (js2-mode . lsp)
    :config
    (setq lsp-prefer-flymake nil)
    (setq lsp-diagnostics-provider :capf)
    (setq lsp-headerline-breadcrumb-enable t)
    (setq lsp-headerline-breadcrumb-segments '(project file symbols))
    (setq lsp-disabled-clients '((python-mode . pyls)))
    :init
    (setq lsp-keymap-prefix "C-c l")) ;; Or 'C-l', 's-l'

  (use-package lsp-ui
    :straight t
    :hook (lsp-mode . lsp-ui-mode)
    :config
    (setq lsp-ui-sideline-enable t)
    (setq lsp-ui-doc-position 'bottom)
    (setq lsp-completion-show-detail nil)
    (setq lsp-completion-show-kind nil)
    (setq lsp-completion-show-label-description nil)
    (setq lsp-completion-enable-additional-text-edit nil)
    (lsp-ui-doc-show))
#+end_src

**** Keybindings
#+begin_src emacs-lisp
(my-leader-def
  :infix "l"
  "" '(:wk "lsp")
  "d" 'xref-find-definitions
  "r" #'xref-find-references
  "n" #'lsp-ui-find-next-reference
  "p" #'lsp-ui-find-prev-reference
  "s" #'counsel-imenu
  "e" #'lsp-ui-flycheck-list
  "S" #'lsp-ui-sideline-mode
  "X" #'lsp-execute-code-action)
#+end_src

*** Flycheck
A syntax checking extension for Emacs. Integrates with LSP-mode, but can also use various standalone checkers.

References:
- [[https://www.flycheck.org/en/latest/][Flycheck homepage]]

#+begin_src emacs-lisp
  (use-package flycheck
    :defer t
    :hook (lsp-mode . flycheck-mode))
#+end_src

*** Tree-sitter

#+begin_src emacs-lisp
(use-package treesit-auto
  :custom
  (treesit-auto-install 'prompt)
  :config
  (treesit-auto-add-to-auto-mode-alist 'all)
  (global-treesit-auto-mode))
#+end_src

*** General additional config
Have to put this before tree-sitter because I need =my/set-smartparens-indent= there.

Make smartparens behave the way I like for C-like languages.
#+begin_src emacs-lisp
(defun my/set-smartparens-indent (mode)
  (sp-local-pair mode "{" nil :post-handlers '(("|| " "SPC") ("||\n[i]" "RET")))
  (sp-local-pair mode "[" nil :post-handlers '(("|| " "SPC") ("||\n[i]" "RET")))
  (sp-local-pair mode "(" nil :post-handlers '(("|| " "SPC") ("||\n[i]" "RET"))))
#+end_src

** C/C++

#+begin_src emacs-lisp
(use-package ccls
  :straight t
  :hook ((c-mode c++-mode objc-mode cuda-mode) .
         (lambda () (require 'ccls) (lsp))))

(setq ccls-executable "ccls")
(setq ccls-args '("--log-file=/tmp/ccls.log"))
(setq ccls-sem-highlight-method 'font-lock)
;;(setq ccls-sem-highlight-method 'overlay)
(ccls-use-default-rainbow-sem-highlight)

  (use-package clang-format
     :straight t
     :config
     (setq clang-format-style-option "file"))
#+end_src

** Rust
#+begin_src emacs-lisp
(use-package rustic
  :config
  (setq rustic-format-on-save t)
  (setq rustic-analyzer-command '("~/.rustup/toolchains/nightly-x86_64-unknown-linux-gnu/bin/rust-analyzer"))
  :custom
  (rustic-analyzer-command '("rustup" "run" "nightly" "rust-analyzer"))
  :general
  (:keymaps 'rustic-mode-map
            :states '(normal visual)
            :prefix "SPC"
            :non-normal-prefix "M-SPC"
            "c" 'rustic-compile
            "r" 'rustic-run
            "b" 'rustic-cargo-build
            "t" 'rustic-test))

(when (memq window-system '(mac ns x))
  (exec-path-from-shell-initialize))
  #+end_src

** Java
#+begin_src emacs-lisp
  (use-package lsp-java
    :straight t
    :after lsp)

  (use-package java
    :straight nil
    :ensure nil
    :after lsp-java
    :bind (:map java-mode-map ("C-c i" . lsp-java-add-import)))
#+end_src

*** Format

#+begin_src emacs-lisp
(setq lsp-java-format-settings-url "https://raw.githubusercontent.com/google/styleguide/gh-pages/eclipse-java-google-style.xml")
(setq lsp-java-format-settings-profile "GoogleStyle")
(add-hook 'java-mode-hook (defun my-set-java-tab-width () (setq c-basic-offset 4)))
#+end_src

** Javascript
#+begin_src emacs-lisp
  (use-package typescript-mode
    :mode "\\.ts\\'"
    :config
    (setq typescript-indent-level 2))

  (defun dw/set-js-indentation ()
    (setq js-indent-level 2)
    (setq evil-shift-width js-indent-level)
    (setq-default tab-width 2))

  (use-package js2-mode
    :mode "\\.jsx?\\'"
    :config
    ;; Use js2-mode for Node scripts
    (add-to-list 'magic-mode-alist '("#!/usr/bin/env node" . js2-mode))

    ;; Don't use built-in syntax checking
    (setq js2-mode-show-strict-warnings nil)

    ;; Set up proper indentation in JavaScript and JSON files
    (add-hook 'js2-mode-hook #'dw/set-js-indentation)
    (add-hook 'json-mode-hook #'dw/set-js-indentation))

  (use-package apheleia
    :config
    (apheleia-global-mode +1))

  (use-package prettier-js
    ;; :hook ((js2-mode . prettier-js-mode)
    ;;        (typescript-mode . prettier-js-mode))
    :config
    (setq prettier-js-show-errors nil))
#+end_src

** HTML

#+begin_src emacs-lisp
(use-package web-mode
  :mode "(\\.\\(html?\\|ejs\\|tsx\\|jsx\\)\\'"
  :config
  (setq-default web-mode-code-indent-offset 2)
  (setq-default web-mode-markup-indent-offset 2)
  (setq-default web-mode-attribute-indent-offset 2))

;; 1. Start the server with `httpd-start'
;; 2. Use `impatient-mode' on any buffer
(use-package impatient-mode)

(use-package emmet-mode
  :hook (html-mode . emmet-mode)
        (css-mode . emmet-mode)
  :config
  (setq emmet-move-cursor-between-quotes t
        emmet-self-closing-tag-style " /"))
(add-hook 'emmet-mode-hook (lambda () (setq emmet-indent-after-insert t)))
        
(defun my-setup-indent ()
  (setq-local css-indent-offset 2))
(add-hook 'prog-mode-hook 'my-setup-indent)
#+end_src

** Nix

#+begin_src emacs-lisp
  (use-package nix-mode
    :straight t)

  (use-package direnv
    :straight t
    :config
    (direnv-mode))
#+end_src

** Miscleanious

*** Take care of camelCase and snake_case words

#+begin_src emacs-lisp
(add-hook 'prog-mode-hook 'subword-mode)
(add-hook 'prog-mode-hook 'superword-mode)
#+end_src

* Applications
** Reading
*** Nov

A major mode for reading EPUBs in Emacs.

#+begin_src emacs-lisp
(use-package nov
  :ensure t
  :mode ("\\.epub\\'" . nov-mode))
  
(use-package nov-xwidget
  :straight (:host github :repo "chenyanming/nov-xwidget")
  :demand t
  :after nov
  :config
  (define-key nov-mode-map (kbd "o") 'nov-xwidget-view)
  (add-hook 'nov-mode-hook 'nov-xwidget-inject-all-files))
#+end_src

*** PDF Tools

#+begin_src emacs-lisp
(use-package pdf-tools
  :ensure t
  :config
  (pdf-tools-install))
#+end_src

** Files
*** Dired

Dired is the built-in Emacs file manager. It's so good that it's strange that, to my knowledge, no one tried to replicate it outside of Emacs.

**** Basic config & keybindings
My config mostly follows ranger's and vifm's keybindings which I'm used to.

#+begin_src emacs-lisp
  (use-package dired
    :ensure nil
    :straight nil
    :commands (dired)
    :config
    (setq dired-listing-switches "-lXGah --group-directories-first")
    (setq dired-dwim-target t)
    (setq wdired-allow-to-change-permissions t)
    (setq wdired-create-parent-directories t)
    (setq dired-recursive-copies 'always)
    (setq dired-recursive-deletes 'always)
    (setq dired-kill-when-opening-new-dired-buffer t)
    (add-hook 'dired-mode-hook
              (lambda ()
                (setq truncate-lines t)
                (visual-line-mode nil)))
      (add-hook 'dired-mode-hook #'dired-hide-details-mode))
    (general-define-key
     :states '(normal)
     :keymaps 'dired-mode-map
     "h" #'dired-up-directory
     "l" #'dired-find-file
     "=" #'dired-narrow
     "-" #'my/dired-create-empty-file-subtree
     "~" #'vterm
     "M-r" #'wdired-change-to-wdired-mode
     "<left>" #'dired-up-directory
     "<right>" #'dired-find-file
     "M-<return>" #'dired-open-xdg)

  (defun my/dired-home ()
    "Open dired at $HOME"
    (interactive)
    (dired (expand-file-name "~")))

  (my-leader-def
    "ad" #'dired)
#+end_src

**** Addons
I used to use [[https://www.emacswiki.org/emacs/DiredPlus][dired+]], which provides a lot of extensions for dired functionality, but it also creates some new problems, so I opt out of it. Fortunately, the one feature I want from this package - adding more colors to dired buffers - is available as a separate package.

#+begin_src emacs-lisp
(use-package diredfl
  :after (dired)
  :config
  (diredfl-global-mode 1))
#+end_src

[[https://github.com/Fuco1/dired-hacks#dired-subtree][dired-subtree]] is a package that enables managing Dired buffers in a tree-like manner. By default =evil-collection= maps =dired-subtree-toggle= to =TAB=.

#+begin_src emacs-lisp
(use-package dired-subtree
  :after (dired))

(defun my/dired-create-empty-file-subtree ()
  (interactive)
  (let ((default-directory (dired-current-directory)))
    (dired-create-empty-file
     (read-file-name "Create empty file: "))))
#+end_src

[[https://github.com/jojojames/dired-sidebar][dired-sidebar]] enables opening Dired in sidebar. For me, with dired-subtree this makes dired a better option than Treemacs.

#+begin_src emacs-lisp :tangle no
(defun my/dired-sidebar-toggle ()
  (interactive)
  (if (not current-prefix-arg)
      (dired-sidebar-toggle-sidebar)
    (let ((dired-sidebar-follow-file-at-point-on-toggle-open
           current-prefix-arg)
          (current-prefix-arg nil))
      (dired-sidebar-toggle-sidebar))))

(use-package dired-sidebar
  :after (dired)
  :commands (dired-sidebar-toggle-sidebar)
  :init
  (setq dired-sidebar-follow-file-at-point-on-toggle-open nil)
  (general-define-key
   :keymaps '(normal override global)
   "C-n" `(my/dired-sidebar-toggle
           :wk "dired-sidebar"))
  :config
  (setq dired-sidebar-width 45)
  (defun my/dired-sidebar-setup ()
    (toggle-truncate-lines 1)
    (display-line-numbers-mode -1)
    (setq-local dired-subtree-use-backgrounds nil)
    (setq-local window-size-fixed nil))
  (general-define-key
   :keymaps 'dired-sidebar-mode-map
   :states '(normal emacs)
   "l" #'dired-sidebar-find-file
   "h" #'dired-sidebar-up-directory
   "=" #'dired-narrow)
  (add-hook 'dired-sidebar-mode-hook #'my/dired-sidebar-setup)
  (advice-add #'dired-create-empty-file :after 'dired-sidebar-refresh-buffer))
#+end_src

[[https://github.com/vifon/dired-recent.el][dired-recent.el]] adds history to dired.

#+begin_src emacs-lisp
(use-package dired-recent
  :after dired
  :commands (dired-recent-open)
  :config
  (dired-recent-mode)
  (general-define-key
   :keymaps 'dired-recent-mode-map
   "C-x C-d" nil)
  (my-leader-def
    "aD" '(dired-recent-open :wk "dired history")))
#+end_src

Display icons for files.

| Note      | Type                                                     |
|-----------+----------------------------------------------------------|
| *ACHTUNG* | This plugin is slow as hell with TRAMP or in =gnu/store= |

#+begin_src emacs-lisp
(use-package all-the-icons-dired
  :hook (dired-mode . (lambda ()
                        (unless (string-match-p "/gnu/store" default-directory)
                          (all-the-icons-dired-mode))))
  :config)
#+end_src

Provides stuff like =dired-open-xdg=

#+begin_src emacs-lisp
(use-package dired-open
  :commands (dired-open-xdg))
#+end_src

[[https://elpa.gnu.org/packages/dired-du.html][dired-du]] is a package that shows directory sizes

#+begin_src emacs-lisp
(use-package dired-du
  :commands (dired-du-mode)
  :config
  (setq dired-du-size-format t))
#+end_src

vifm-like filter

#+begin_src emacs-lisp
(use-package dired-narrow
  :commands (dired-narrow)
  :config
  (general-define-key
   :keymaps 'dired-narrow-map
   [escape] 'keyboard-quit))
#+end_src

Display git info, such as the last commit for file and stuff. It's pretty useful but also slows down Dired a bit, hence I don't turn it out by default.

#+begin_src emacs-lisp
(use-package dired-git-info
  :after dired
  :config
  (general-define-key
   :keymap 'dired-mode-map
   :states '(normal emacs)
   ")" 'dired-git-info-mode))
#+end_src

**** Subdirectories
Subdirectories are one of the interesting features of Dired. It allows displaying multiple folders on the same window.

I add my own keybindings and some extra functionality.

#+begin_src emacs-lisp
(defun my/dired-open-this-subdir ()
  (interactive)
  (dired (dired-current-directory)))

(defun my/dired-kill-all-subdirs ()
  (interactive)
  (let ((dir dired-directory))
    (kill-buffer (current-buffer))
    (dired dir)))

(with-eval-after-load 'dired
  (general-define-key
   :states '(normal)
   :keymaps 'dired-mode-map
   "s" nil
   "ss" 'dired-maybe-insert-subdir
   "sl" 'dired-maybe-insert-subdir
   "sq" 'dired-kill-subdir
   "sk" 'dired-prev-subdir
   "sj" 'dired-next-subdir
   "sS" 'my/dired-open-this-subdir
   "sQ" 'my/dired-kill-all-subdirs
   (kbd "TAB") 'dired-hide-subdir))
#+end_src

** Shells / Terminals
*** vterm
My terminal emulator of choice.

References:
- [[https://github.com/akermu/emacs-libvterm][emacs-libvterm repo]]

